toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

static void _CapturePause() {
    _TaskMain::Reset();
}

static void _CaptureResume() {
    _TaskMain::Start();
}

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _PowerAssertion power;
            power.acquire();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
            // Relinquish LEDs
            _LEDRed_::Set(_LEDRed_::Priority::High, std::nullopt);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, std::nullopt);
            
            // Release capture-pause assertion if it was held
            _HostMode = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDRed_::Priority::High, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en != _HostMode.acquired()) {
                if (cmd.arg.HostModeSet.en) {
                    _HostMode.acquire();
                } else {
                    _HostMode.release();
                }
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static bool HostModeEnabled() {
        return _HostMode.acquired();
    }
    
    static inline _CapturePauseAssertion _HostMode;
    
    // Task stack
    [[gnu::section(".stack._TaskI2C")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

struct _TaskButton {
    static void Run() {
        // Pause captures upon power on. This is so that the device is off until
        // the user turns it on by holding the power button.
        _CapturePause.acquire();
        
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_TaskI2C::HostModeEnabled()) continue;
            
            // Keep the lights on until we're done handling the event
            _PowerAssertion power;
            power.acquire();
            
            switch (ev) {
            case _Button::Event::Press:
                // Ignore button presses if we're off
                if (_CapturePause.acquired()) break;
                
                // Take a photo
                _LEDRed_::Set(_LEDRed_::Priority::Low, 0);
                _Scheduler::Sleep(_Scheduler::Ms(250));
                _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
                break;
            
            case _Button::Event::Hold:
                if (_CapturePause.acquired()) {
                    // Deassert capture pause -- ie, turn on
                    _CapturePause.release();
                    // Flash green LEDs
                    _LEDFlash<_Pin::LED_GREEN_>();
                
                } else {
                    // Assert capture pause -- ie, turn off
                    _CapturePause.acquire();
                    // Flash red LEDs
                    _LEDFlash<_Pin::LED_RED_>();
                }
                
                _Button::WaitForDeassert();
                
//                _Pause.toggle();
//                if (_Pause.asserted()) {
//                    // Flash red LED to signal that we're turning off
//                    for (int i=0; i<5; i++) {
//                        _Pin::LED_RED_::Write(0);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                        _Pin::LED_RED_::Write(1);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                    }
//                }
//                
//                #warning TODO: disable any timer interrupt sources that we may have set up, so we don't wake to take a photo
//                
//                _MOTION_SIGNAL_DISABLED::Init<_Pin::MOTION_SIGNAL>();
//                
//                // Configure button for device turning off
//                _Button::OffConfig();
//                
//                // Turn off
//                __Sleep(_SleepMode::Deep);
                break;
            }
        }
    }
    
    template <typename T_Pin>
    static void _LEDFlash() {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            T_Pin::Write(0);
            _Scheduler::Delay(_Scheduler::Ms(50));
            T_Pin::Write(1);
            _Scheduler::Delay(_Scheduler::Ms(50));
        }
    }
    
    // _CapturePause: controls user-visible on/off behavior
    // By default, captures are paused so that the device is off until
    // the user turns it on by holding the power button.
    static inline _CapturePauseAssertion _CapturePause;
    
