toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // I2C (config chosen by _I2C)
        _I2C::Pin::SCL,
        _I2C::Pin::SDA,
        _I2C::Pin::Active,
        
        // Battery (config chosen by _BatterySampler)
        _BatterySampler::Pin::BatChrgLvlPin,
        _BatterySampler::Pin::BatChrgLvlEn_Pin,
        
        // Button
        _Button::Pin
    >();
    
    // Init clock
    _Clock::Init();
    
    // Init RTC
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
    _RTC::Init();
    
    // Init SysTick
    _SysTick::Init();
    
    // Init _BatterySampler
    _BatterySampler::Init();
    
    // Init LEDs by setting their low-priority / 'backstop' values to off.
    // This is necessary so that relinquishing the LEDs from I2C task causes
    // them to turn off. If we didn't have a backstop value, the LEDs would
    // remain in whatever state the I2C task set them to before relinquishing.
    _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
    _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
    
//    // Blink green LED to signal that we're turning off
//    for (;;) {
//        for (int i=0; i<5; i++) {
//            _Pin::LED_GREEN_::Write(0);
//            for (volatile int i=0; i<0xFFFF; i++);
//            _Pin::LED_GREEN_::Write(1);
//            for (volatile int i=0; i<0xFFFF; i++);
//        }
//    }
    
//    _Scheduler::Start<_TaskButton>();
    _Scheduler::Start<_TaskButton, _TaskI2C>();
    _Scheduler::Run();
}
